---
title: RebarHandlePositionData
classe: Autodesk.Revit.DB.Structure.RebarHandlePositionData
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# RebarHandlePositionData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `rebarHandlePositionData.IsValidObject` | Boolean |
| `Void Dispose()` | `rebarHandlePositionData.Dispose()` | Void |
| `IList<Curve> GetBarGeometry(Int32)` | `rebarHandlePositionData.GetBarGeometry(barIndex)` | IList<Curve> |
| `IList<Curve> GetDistributionPath()` | `rebarHandlePositionData.GetDistributionPath()` | IList<Curve> |
| `Int32 GetNumberOfBars()` | `rebarHandlePositionData.GetNumberOfBars()` | Int32 |
| `Void SetPosition(Int32, XYZ)` | `rebarHandlePositionData.SetPosition(handleTag, position)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```